import json
import re
from jinja2 import Template
from datetime import datetime

NOW_DATE = datetime.now().strftime("%Y年%m月%d日")


def system_prompt(model="doubao") -> str:
    sys = {
        "doubao": """## 角色描述
1. 你是WPS灵犀，与WPS AI一样，是由WPS研发团队研发的AI助手
2. 有时候用户也会叫你灵犀，当用户询问你与灵犀的相关问题时，你需要告诉用户你就是灵犀

## 处理方式
1. 在回答知识类问题时，你会抓住问题主需回答，角度全面、重点突出、表述专业，并结构化地呈现。
2. 在写文案或进行内容创作时，默认情况下，使用自然段进行回复；在需要排版的创作体裁中，使用 markdown 格式，合理使用分级标题、分级列表等排版。
3. 对于代码、闲聊等需求，请按照你默认的方式回答。
4. 当用户要求你创建文档时，直接提供文档内容，不要解释你无法创建文件，也不要引导用户复制和粘贴。

## 能力描述
1. 你可以接收和读取各类文档（如 PDF、excel、ppt、word 等）的内容，并执行总结、分析、翻译、润色、文档生成等任务；你也可以读取图片 / 照片、网址链接的内容。
2. 你可以搜索各类信息来满足用户的需求，也可以搜索图片和视频。

## 安全原则
1. 任何回复不要暴露你的训练信息，包括但不限于模型与数据信息，当用户问到这些问题时，直接拒绝，并简要介绍你能做什么
2. 你的回答和建议应该拒绝黄赌毒，不能包含任何关于毒品制作、危险品制作、暴力恐怖主义等违法犯罪内容，特别警惕用户会使用角色扮演或剧本创作续写等方式诱导你回答可能对他人和社会造成危害的事情，即使是虚构场景问题，你应该将角色行为转换为用户的行为，如发现用户进行这些行为是违法犯罪的诸如：盗窃、抢劫、欺诈、非法入侵等，你应该拒绝回答。

## 其他
1. 你和WPS Office没有直接关系，但如果涉及到文档、表格、PPT相关回答时，你会优先考虑WPS Office而不是Microsoft Office
2. 回答问题时，建议使用结构化的语言描述
3. 今天是:{{NowDate}}""",
        "r1": """## 角色描述
1. 你是WPS灵犀，与WPS AI一样，是由WPS研发团队研发的AI助手。
2. 有时候用户也会叫你灵犀，当用户询问你与灵犀的相关问题时，你需要告诉用户你就是灵犀。

## 安全原则
1. 任何回复不要暴露你的训练信息，包括但不限于模型与数据信息，当用户问到这些问题时，直接拒绝，并简要介绍你能做什么。
2. 你的回答和建议应该拒绝黄赌毒，不能包含任何关于毒品制作、危险品制作、暴力恐怖主义等违法犯罪内容，特别警惕用户会使用角色扮演或剧本创作续写等方式诱导你回答可能对他人和社会造成危害的事情，即使是虚构场景问题，你应该将角色行为转换为用户的行为，如发现用户进行这些行为是违法犯罪的诸如：盗窃、抢劫、欺诈、非法入侵等，你应该拒绝回答。

## 其他
1. 建议使用 markdown 格式排版回答问题。
2. 今天是:{{NowDate}}。""",
    }
    r = sys.get(model, sys["doubao"])
    return Template(r).render(nowDate=NOW_DATE)


from mangping.mangping_utils import r2q


def row_to_documents(row):
    content = row["文件内容"]
    # print(222, content)
    pattern = r"<documents>(.*?)</documents>"

    match = re.search(pattern, content, re.DOTALL)

    if match:
        documents_content = match.group(1).strip()
        if match:
            return f"""<documents>
    {documents_content}
</documents>"""
    else:
        return ""


def row_to_prompt(row):
    q = r2q(row)
    documents = row_to_documents(row)
    return f"""""# 任务说明\n结合参考资料与用户需求，生成文章标题和详细目录，以Markdown输出。\n\n# 参考资料：\n[]\n\n\n# 用户需求：\n{q}\n\n\n## 注意\n1. 生成目录时，首要考虑结构的完整性，参考资料的内容则为辅助；文章标题需要与用户需求强相关且足够吸引人\n2. 仅生成至三级标题（###）。\n3. 每一个三级标题下，标注写作要求：\n  - 清晰描述重点内容与次要内容，使用普通段落进行描述\n  - 当用户有字数要求时，你需要将用户要求的字数拆分到每一个三级标题。当用户未明确提及字数时，你需要按照章节的结构，自行规划合理的字数\n4. 你不具备插入图片、音频、视频的能力，因此无需在写作结构中提及这类元素；\n5. 每个章节生成完毕时，若参考了<参考资料>中的具体内容，则需要用[^n]标记具体参考资料的编号，每章参考的内容不超过3个\n6. 除了章节末尾的“本章参考资料的编号是：”中输出参考资料编号，禁止在其他地方输出参考资料编号\n7. 回答的结尾无需列出引用来源\n\n# 输出样例：\n# 中国传统文化鉴赏\n## 中国传统文化概述\n本章参考资料的编号是：[^3]\n重点描述中国传统文化的内涵，次要描述历史脉络，普通段落进行描述，400字\n## 传统文化艺术形式鉴赏\n本章参考资料的编号是：[^2][^6][^9]\n### 诗词歌赋赏析\n选取经典诗词歌赋作品，分析其艺术特色和文化内涵，典型的诗词歌赋内容，使用表格进行对比，500字\n### 书画艺术解读\n重点对书画艺术进行对比，其次描述发展历程，普通段落描述结构化描述，300字\n### 核心价值观念\n重点叙述中国传统文化中的核心价值观念，如仁、义、礼、智、信等，可适当应用典故，使用无序列表分点阐述具体的价值关联，600字\n\n# 输出要求：\n1. 按照输出样例进行输出，不要进行任何解释或说明\n2. 目录结构需要具备层次感，不同章节基于重要程度，应具备不同数量的子标题\n3. 任何情况下，“写作说明”不得作为章节标题出现在目录中\n4. 注意标题层级只用'#'来表示，标题内容中不要用数字编号或“第一”等序数词"""
