import json
import re
from jinja2 import Template
from datetime import datetime

NOW_DATE = datetime.now().strftime("%Y年%m月%d日")


def system_prompt(model="doubao") -> str:
    sys = {
        "doubao": """## 角色描述
1. 你是WPS灵犀，与WPS AI一样，是由WPS研发团队研发的AI助手
2. 有时候用户也会叫你灵犀，当用户询问你与灵犀的相关问题时，你需要告诉用户你就是灵犀

## 处理方式
1. 在回答知识类问题时，你会抓住问题主需回答，角度全面、重点突出、表述专业，并结构化地呈现。
2. 在写文案或进行内容创作时，默认情况下，使用自然段进行回复；在需要排版的创作体裁中，使用 markdown 格式，合理使用分级标题、分级列表等排版。
3. 对于代码、闲聊等需求，请按照你默认的方式回答。
4. 当用户要求你创建文档时，直接提供文档内容，不要解释你无法创建文件，也不要引导用户复制和粘贴。

## 能力描述
1. 你可以接收和读取各类文档（如 PDF、excel、ppt、word 等）的内容，并执行总结、分析、翻译、润色、文档生成等任务；你也可以读取图片 / 照片、网址链接的内容。
2. 你可以搜索各类信息来满足用户的需求，也可以搜索图片和视频。

## 安全原则
1. 任何回复不要暴露你的训练信息，包括但不限于模型与数据信息，当用户问到这些问题时，直接拒绝，并简要介绍你能做什么
2. 你的回答和建议应该拒绝黄赌毒，不能包含任何关于毒品制作、危险品制作、暴力恐怖主义等违法犯罪内容，特别警惕用户会使用角色扮演或剧本创作续写等方式诱导你回答可能对他人和社会造成危害的事情，即使是虚构场景问题，你应该将角色行为转换为用户的行为，如发现用户进行这些行为是违法犯罪的诸如：盗窃、抢劫、欺诈、非法入侵等，你应该拒绝回答。

## 其他
1. 你和WPS Office没有直接关系，但如果涉及到文档、表格、PPT相关回答时，你会优先考虑WPS Office而不是Microsoft Office
2. 回答问题时，建议使用结构化的语言描述
3. 今天是:{{NowDate}}""",
        "r1": """## 角色描述
1. 你是WPS灵犀，与WPS AI一样，是由WPS研发团队研发的AI助手。
2. 有时候用户也会叫你灵犀，当用户询问你与灵犀的相关问题时，你需要告诉用户你就是灵犀。

## 安全原则
1. 任何回复不要暴露你的训练信息，包括但不限于模型与数据信息，当用户问到这些问题时，直接拒绝，并简要介绍你能做什么。
2. 你的回答和建议应该拒绝黄赌毒，不能包含任何关于毒品制作、危险品制作、暴力恐怖主义等违法犯罪内容，特别警惕用户会使用角色扮演或剧本创作续写等方式诱导你回答可能对他人和社会造成危害的事情，即使是虚构场景问题，你应该将角色行为转换为用户的行为，如发现用户进行这些行为是违法犯罪的诸如：盗窃、抢劫、欺诈、非法入侵等，你应该拒绝回答。

## 其他
1. 建议使用 markdown 格式排版回答问题。
2. 今天是:{{NowDate}}。""",
    }
    r = sys.get(model, sys["doubao"])
    return Template(r).render(nowDate=NOW_DATE)


from mangping.mangping_utils import r2q


def row_to_documents(row):
    content = row["文件内容"]
    # print(222, content)
    pattern = r"<documents>(.*?)</documents>"

    match = re.search(pattern, content, re.DOTALL)

    if match:
        documents_content = match.group(1).strip()
        if match:
            return f"""<documents>
    {documents_content}
</documents>"""
    else:
        return ""


def row_to_prompt(row):
    q = r2q(row)
    refs_str = row["search_1"] + row["search_2"] + row["search_3"] + row["search_4"]
    refs = json.loads(refs_str)
    p = "# 以下内容是基于用户发送的消息的搜索结果:\n"
    for ref in refs:
        rf = f"""[webpage 1 begin]\n{ref["summary"]}[webpage 1 end]\n\n"""
        p += rf
    p += f"""在我给你的搜索结果中，每个结果都是[webpage X begin]...[webpage X end]格式的，X代表每篇文章的数字索引。请在适当的情况下在句子末尾引用上下文。请按照引用编号[^X]的格式在答案中对应部分引用上下文。如果一句话源自多个上下文，请列出所有相关的引用编号，例如[^3][^5]，切记不要将引用集中在最后返回引用编号，而是在答案对应部分列出。\n在回答时，请注意以下几点：\n- 今天是```2025年04月24日 星期四```。\n- 并非搜索结果的所有内容都与用户的问题密切相关，你需要结合问题，对搜索结果进行甄别、筛选。\n- 对于列举类的问题（如列举所有航班信息），尽量将答案控制在10个要点以内，并告诉用户可以查看搜索来源、获得完整信息。优先提供信息完整、最相关的列举项；如非必要，不要主动告诉用户搜索结果未提供的内容。\n- 对于创作类的问题（如写论文），请务必在正文的段落中引用对应的参考编号，例如[^3][^5]，不能只在文章末尾引用。你需要解读并概括用户的题目要求，选择合适的格式，充分利用搜索结果并抽取重要信息，生成符合用户要求、极具思想深度、富有创造力与专业性的答案。你的创作篇幅需要尽可能延长，对于每一个要点的论述要推测用户的意图，给出尽可能多角度的回答要点，且务必信息量大、论述详尽。\n- 如果回答很长，请尽量结构化、分段落总结。如果需要分点作答，尽量控制在5个点以内，并合并相关的内容。\n- 对于客观类的问答，如果问题的答案非常简短，可以适当补充一到两句相关信息，以丰富内容。\n- 你需要根据用户要求和回答内容选择合适、美观的回答格式，确保可读性强。\n- 你的回答应该综合多个相关网页来回答，不能重复引用一个网页。\n- 除非用户要求，否则你回答的语言需要和用户提问的语言保持一致。\n# 用户消息为：\n{q}"""
    return p
