import airsheet_sdk.airsheet as airsheet

wps_sid = ""
file_id = "croDWeMU72Lp"
sheet_name = "Sheet1"

text = r"""<documents>
<document>
<document_type>网页</document_type>
<document_name>鱼我所欲也原文、翻译及赏析、拼音版及朗读_孟子及其弟子文言文_古诗文网</document_name>
<document_url>https://www.gushiwen.cn/shiwenv_740f1087a38c.aspx</document_url>
<document_content>鱼我所欲也

孟子及其弟子〔先秦〕

　　鱼，我所欲也；熊掌，亦我所欲也。二者不可得兼，舍鱼而取熊掌者也。生，亦我所欲也；义，亦我所欲也。二者不可得兼，舍生而取义者也。生亦我所欲，所欲有甚于生者，故不为苟得也；死亦我所恶，所恶有甚于死者，故患有所不辟也。如使人之所欲莫甚于生，则凡可以得生者何不用也？使人之所恶莫甚于死者，则凡可以辟患者何不为也？由是则生而有不用也，由是则可以辟患而有不为也。是故所欲有甚于生者，所恶有甚于死者。非独贤者有是心也，人皆有之，贤者能勿丧耳。　　一箪食，一豆羹，得之则生，弗得则死。呼尔而与之，行道之人弗受；蹴尔而与之，乞人不屑也。万钟则不辩礼义而受之，万钟于我何加焉！为宫室之美、妻妾之奉、所识穷乏者得我与？乡为身死而不受，今为宫室之美为之；乡为身死而不受，今为妻妾之奉为之；乡为身死而不受，今为所识穷乏者得我而为之：是亦不可以已乎？此之谓失其本心。　(与 同：欤)






译文及注释


译文　　鱼是我所想要的，熊掌也是我所想要的，如果这两种东西不能同时具有，那么我就只好舍弃鱼而选取熊掌了。生命是我所想要的，道义也是我所想要的，如果这两样东西不能同时都具有，那么我就只好牺牲生命而选取道义了。生命是我所想要的，但我所想要的还有比生命更重要的东西，所以我不做苟且偷生的事。死亡是我所厌恶的，但我所厌恶的还有超过死亡的事，因此有的灾祸我也不躲避。假如人们所想要的东西没有能比生命更重要的，那么凡是能够用来保全生命的手段，哪一样不可以采用呢？如果人们所厌恶的事情没有超过死亡的，那么一切可以躲避祸患的办法为什么不可以做呢？采用某种手段就能够活命，但是有的人却不肯采用；采用某






文言知识


一、重点字解释1、鱼，我所欲也。欲：喜爱的，想要的2、二者不可得兼。兼：同时3、生亦我所欲也。生：生命4、所欲者有甚于生者。甚：超过5、故不为苟得也。苟得：苟且偷生6、故患有所不辟也。患：祸患、灾难辟：通“避”，躲避7、如使人之所欲莫甚于生。 如使：假使8、非独贤者有是心也。是：这种9、贤者能勿丧耳。勿：不丧：丢掉、丧失10、呼尔而与之。呼：吆喝、呵斥与：给11、蹴尔而与之。蹴：用脚踩踏12、乞人不屑也。不屑：因轻视而不肯接受13、万






赏析


　　《鱼我所欲也》选自《孟子·告子上》，论述了孟子的一个重要主张：义重于生，当义和生不能两全时应该舍生取义。
　　孟子认为自己做了坏事感到耻辱，别人做了坏事感到厌恶，这就是义；义是有道德的君子所必须遵循的正路。
　　孟子先用人们生活中熟知的具体事物打了一个比方：鱼是我想得到的，熊掌也是我想得到的，在两者不能同时得到的情况下，我宁愿舍弃鱼而要熊掌；生命是我所珍爱的，义也是我所珍爱的，在两者不能同时得到的情况下，我宁愿舍弃生命而要义。孟子把生命比作鱼，把义比作熊掌，认为义比生命更珍贵就像熊掌比鱼更珍贵一样，这样就很自然地引出了“舍生取义”的主张。这个主张是全篇





简析


　　《鱼我所欲也》是孟子以他的性善论为依据，对人的生死观进行深入讨论的一篇代表作，出自《孟子·告子上》。为了把道理说得深入浅出、生动有趣，作者多用比喻，本篇以具体的鱼和熊掌比喻抽象的“生”和“义”，同时，他也使用排比的修辞手法加强了气势，增强了感情。　　文章强调“正义”比“生命”更重要，主张舍生取义。作者认为人应该保持善良的本性，加强平时的修养及教育，不做有悖礼仪的事，他认为这一思想是中华民族传统道德修养的精华。全文气势充沛，感情强烈，生动活泼，表现了孟子雄辩、善辩的才华，也充分体现了孟子大义凛然的个性。




赏析二


　　本文节选自《孟子·告子上》。《告子上》的主要内容是阐明“性善说”，即人性里天生就有向善的种子，所谓“恻隐之心，人皆有之；羞恶之心，人皆有之；恭敬之心，人皆有之；是非之心，人皆有之”。这种善的天性，就是人的“本心”。“本心”不可小视，因为它们分别是仁义礼智这几种道德的萌芽形态：“恻隐之心，仁之端也；羞恶之心，义之端也；辞让（意近“恭敬”）之心，礼之端也；是非之心，智之端也。”人应该推求本心，顺着“本心”的方向发展，并将它发扬光大，从而成为道德上完善的人。
　　放到《告子上》全文里看，本文讲的是每个人都有“本心”，无论在什么情况下，人都应该保有自己的“本心”。只要“本心”

















刻舟求剑

《吕氏春秋》〔先秦〕

楚人有涉江者，其剑自舟中坠于水。遽契其舟，曰：“是吾剑之所从坠。”舟止，从其所契者入水求之。舟已行矣，而剑不行，求剑若此，不亦惑乎！
















臣工

诗经·周颂·臣工之什〔先秦〕
嗟嗟臣工，敬尔在公。王厘尔成，来咨来茹。嗟嗟保介，维莫之春，亦又何求？如何新畲？於皇来牟，将受厥明。明昭上帝，迄用康年。命我众人：庤乃钱镈，奄观铚艾。













良狗捕鼠

吕氏春秋〔先秦〕

　　齐有善相狗者，其邻假以买取鼠之狗，期年乃得之，曰：“是良狗也。”其邻畜之数年，而不取鼠。以告相者，相者曰：“此良狗也，其志在獐麋豕鹿，不在鼠;欲其取鼠也，则桎之！”其邻桎其后足，狗乃取鼠。</document_content>
</document>
</documents>
"""

text1 = text[:30000]
text2 = text[30000:60000]
text3 = text[60000:90000]
text4 = text[90000:120000]
text5 = text[120000:150000]
text6 = text[150000:180000]
text7 = text[180000:210000]
text8 = text[210000:240000]
text9 = text[240000:270000]
text10 = text[270000:300000]


airsheet.init(wps_sid=wps_sid, file_id=file_id, sheet_name=sheet_name)

airsheet.write_xl(
    [text1, text2, text3, text4, text5, text6, text7, text8, text9, text10],
    "D28",
    sheet_name=sheet_name,
)
